app/Http/Controllers/Qlyxe/CategoryController.php

    public function edit($id){
        $this->_data['item'] = Category::find($id);
---
select * from `categories` where `categories`.`id` = '1' limit 1

    public function getCategory($type){
        return DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.id', 'A.parent', 'B.title')
            ->where('A.type',$type)
            ->where('B.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();
---
select `A`.`id`, `A`.`parent`, `B`.`title` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `A`.`type` = 'thue-xe' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc