app/Http/Controllers/Qlyxe/OrderController.php

select * from `orders` as `A` where `A`.`type` = 'thue-xe' order by `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `orders` as `A` where `A`.`type` = 'thue-xe'
select sum(order_qty) as qty, sum(order_price) as price from `orders` where `status_id` < '4' and `type` = 'thue-xe' limit 1
---
    public function index(){

        $this->_data['items'] = DB::table('orders as A')
            ->where('A.type',$this->_data['type'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);

        $this->_data['total'] = DB::table('orders')
            ->select(DB::raw('sum(order_qty) as qty, sum(order_price) as price'))
            ->where('status_id', '<' , 4)
            ->where('type',$this->_data['type'])->first();

select * from `orders` where `orders`.`id` = '1' limit 1
---
    public function edit($id){
        $this->_data['item'] = Order::find($id);