app/Http/Controllers/Qlyxe/ProductController.php

    public function index(Request $request){
        $whereRaw = "A.type='".$this->_data['type']."'";
        $whereRaw .= $request->category_id ? " and A.category_id=".$request->category_id : "";
        $whereRaw .= $request->title ? " and (A.code like '%".$request->title."%' or B.title like '%".$request->title."%') " : "";
        $whereRaw .= $request->created_at ? " and A.created_at like '%".$request->created_at."%'" : "";
        $whereRaw .= $request->status ? " and FIND_IN_SET('".$request->status."',A.status)" : "";
        $this->_data['oldInput'] = $request->all();
        $this->_data['categories'] = $this->getCategories($this->_data['type']);
        $this->_data['items'] = DB::table('products as A')
            ->leftjoin('product_languages as B', 'A.id','=','B.product_id')
            ->leftjoin('category_languages as C', 'A.category_id','=','C.category_id')
            ->select('A.*','B.title','C.title as category')
            ->whereRaw($whereRaw)
            ->where('B.language', $this->_data['default_language'])
            ->where('C.language', $this->_data['default_language'])
            ->orderBy('A.user_id', Auth::id())
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);
---
select `A`.*, `B`.`title`, `C`.`title` as `category` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` left join `category_languages` as `C` on `A`.`category_id` = `C`.`category_id` where A.type='thue-xe' and `B`.`language` = 'vi' and `C`.`language` = 'vi' order by `A`.`user_id` desc, `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` left join `category_languages` as `C` on `A`.`category_id` = `C`.`category_id` where A.type='thue-xe' and `B`.`language` = 'vi' and `C`.`language` = 'vi'

            $product->type           = $this->_data['type'];
            $product->created_at     = new DateTime();
            $product->updated_at     = new DateTime();
            $product->save();
---
insert into `products` (`category_id`, `alt`, `code`, `original_price`, `regular_price`, `sale_price`, `weight`, `priority`, `status`, `user_id`, `type`, `created_at`, `updated_at`) values ('1', '', '', '0', '0', '0', '0', '1', 'publish', '2', 'thue-xe', '2018-08-16 19:07:37', '2018-08-16 19:07:37')

                $dataL['language']   = $lang;
                $dataInsert[]        = new ProductLanguage($dataL);
            }
            $product->languages()->saveMany($dataInsert);
---
insert into `product_languages` (`title`, `description`, `slug`, `attributes`, `language`, `product_id`) values ('Xe số 1', '', 'xe-so-1', '[{\"name\":null,\"value\":null}]', 'vi', '1')

    public function edit($id){
        $this->_data['item'] = Product::find($id);
---
select * from `products` where `products`.`id` = '1' limit 1

    public function getSupplier($type='default'){
        return DB::table('suppliers')
            ->where('type',$type)
            ->orderBy('priority','asc')
            ->orderBy('id','desc')
            ->get();
---
select * from `suppliers` where `type` = 'default' order by `priority` asc, `id` desc

    public function getCategories($type){
        return DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.id', 'A.parent', 'B.title')
            ->whereRaw('(A.type = \''.$type.'\' or A.type = \'default\')')
            ->where('B.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();
---
select `A`.`id`, `A`.`parent`, `B`.`title` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where (A.type = 'thue-xe' or A.type = 'default') and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc

    public function getMediaLibrary($attachments){
        $arrID = explode(',',$attachments);
        return MediaLibrary::select('*')->whereIn('id',$arrID)->orderBy('priority','asc')->orderBy('id','desc')->get();
---
select * from `media_libraries` where `id` in ('') order by `priority` asc, `id` desc