app/Functions/ToolFactory.php

select `A`.`id`, `A`.`parent`, `A`.`icon`, `B`.`title`, `B`.`slug` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `B`.`language` is null and FIND_IN_SET('publish',A.status) and `A`.`priority` > '0' and `A`.`type` = 'san-pham' order by `A`.`priority` asc, `A`.`id` desc
---
    public function getCategories($type,$lang='vi'){
        return DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.id', 'A.parent', 'A.icon', 'B.title', 'B.slug')
            ->where('B.language', $lang)
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.priority','>',0)
            ->where('A.type',$type)
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();

select `A`.*, `B`.`slug`, `B`.`title`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` is null and FIND_IN_SET('publish',A.status) and `A`.`type` = 'chinh-sach-quy-dinh' order by `A`.`priority` asc, `A`.`id` desc
---
    public function getPosts($type,$lang='vi'){
        return DB::table('posts as A')
            ->leftjoin('post_languages as B', 'A.id','=','B.post_id' )
            ->select('A.*','B.slug','B.title','B.description')
            ->where('B.language',$lang)
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type',$type)
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();

select `A`.*, `B`.`title`, `B`.`description` from `photos` as `A` left join `photo_languages` as `B` on `A`.`id` = `B`.`photo_id` where `B`.`language` is null and FIND_IN_SET('publish',A.status) and `A`.`type` = 'slideshow' order by `A`.`priority` asc, `A`.`id` desc
---
    public function getPhotos($type,$lang='vi'){
        return DB::table('photos as A')
            ->leftjoin('photo_languages as B', 'A.id','=','B.photo_id' )
            ->select('A.*','B.title','B.description')
            ->where('B.language',$lang)
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type',$type)
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();

select `A`.*, `B`.`title`, `B`.`description` from `links` as `A` left join `link_languages` as `B` on `A`.`id` = `B`.`link_id` where `B`.`language` is null and FIND_IN_SET('publish',A.status) and `A`.`type` = 'tieu-chi' order by `A`.`priority` asc, `A`.`id` desc
select `A`.*, `B`.`title`, `B`.`description` from `photos` as `A` left join `photo_languages` as `B` on `A`.`id` = `B`.`photo_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'background' and `A`.`link` = 'http://localhost/laravel/begreen/san-pham/ten-san-pham-1.html' order by `A`.`priority` asc, `A`.`id` desc limit 1
---
    public function getPhotoByUrl($url,$type,$lang='vi'){
        return DB::table('photos as A')
            ->leftjoin('photo_languages as B', 'A.id','=','B.photo_id' )
            ->select('A.*','B.title','B.description')
            ->where('B.language',$lang)
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type',$type)
            ->where('A.link',$url)
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->first();

select `A`.*, `B`.`title`, `B`.`description` from `links` as `A` left join `link_languages` as `B` on `A`.`id` = `B`.`link_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'social' order by `A`.`priority` asc, `A`.`id` desc
---
    public function getLinks($type,$lang='vi'){
        return DB::table('links as A')
            ->leftjoin('link_languages as B', 'A.id','=','B.link_id' )
            ->select('A.*','B.title','B.description')
            ->where('B.language',$lang)
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type',$type)
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();

select `A`.*, `B`.`slug`, `B`.`title`, `B`.`description`, `B`.`contents`, `B`.`meta_seo` from `pages` as `A` left join `page_languages` as `B` on `A`.`id` = `B`.`page_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'footer' order by `A`.`priority` asc, `A`.`id` desc limit 1
---
    public function getPages($type,$lang='vi'){
        return DB::table('pages as A')
            ->leftjoin('page_languages as B', 'A.id','=','B.page_id' )
            ->select('A.*','B.slug','B.title','B.description','B.contents','B.meta_seo')
            ->where('B.language',$lang)
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type',$type)
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->first();

select `A`.*, `B`.`slug`, `B`.`title`, `B`.`meta_seo` from `seos` as `A` left join `seo_languages` as `B` on `A`.`id` = `B`.`seo_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`link` = 'http://localhost/laravel/begreen/san-pham/ten-san-pham-1.html' order by `A`.`priority` asc, `A`.`id` desc limit 1
---
    public function getSeos($url,$lang='vi'){
        return DB::table('seos as A')
            ->leftjoin('seo_languages as B', 'A.id','=','B.seo_id' )
            ->select('A.*','B.slug','B.title','B.meta_seo')
            ->where('B.language',$lang)
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.link', $url )
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->first();

select `A`.*, `B`.`title`, `B`.`slug` from `attributes` as `A` left join `attribute_languages` as `B` on `A`.`id` = `B`.`attribute_id` where `B`.`language` = 'vi' and `A`.`type` = 'product_tags' order by `A`.`priority` asc, `A`.`id` desc
---
    public function getAttributes($type,$lang='vi'){
        return DB::table('attributes as A')
            ->leftjoin('attribute_languages as B', 'A.id','=','B.attribute_id')
            ->select('A.*','B.title','B.slug')
            ->where('B.language', $lang)
            ->where('A.type',$type)
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();

select * from `media_libraries` where `id` in ('1', '2', '3', '4') order by `priority` asc, `id` desc
---
    public function getMediaLibrary($attachments){
        $arrID = explode(',',$attachments);
        return DB::table('media_libraries')
            ->select('*')
            ->whereIn('id',$arrID)
            ->orderBy('priority','asc')
            ->orderBy('id','desc')
            ->get();