app/Http/Controllers/Frontend/AjaxController.php

insert into `comments` (`parent`, `product_id`, `post_id`, `member_id`, `name`, `email`, `title`, `description`, `score`, `status`, `type`, `created_at`, `updated_at`) values ('4', '10', '', '', '', '', '', 'ẻgergerg', '1', '', 'default', '2018-07-31 23:03:33', '2018-07-31 23:03:33')
---
            $data_insert['created_at'] = new DateTime();
            $data_insert['updated_at'] = new DateTime();

            if(DB::table('comments')->insert($data_insert)){