app/Http/Controllers/Frontend/CartController.php

    public function checkOut(Request $request){
        $this->_data['site']['title'] = __('site.checkout');
        $this->_data['breadcrumb'] = '<li> <a href="'.url('/').'">'.__('site.home').'</a> </li>';
        $this->_data['breadcrumb'] .= '<li> <a href="'.url('/thanh-toan').'"> '.$this->_data['site']['title'].' </a> </li>';
        $this->_data['payments'] = DB::table('posts as A')
            ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
            ->select('A.id','A.link','B.title','B.slug','B.description')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type','payment')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();
---
select `A`.`id`, `A`.`link`, `B`.`title`, `B`.`slug`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'payment' order by `A`.`priority` asc, `A`.`id` desc

    public function coupon(Request $request){
        if ($request->ajax()) {
            if( count($this->_data['coupon']) == 0 || $this->_data['coupon']['code'] != $request->code ){
                $this->_data['coupon'] = Coupon::where('code',$request->code)->whereRaw('FIND_IN_SET(\'publish\',status)')->first();
---
select * from `coupons` where `code` = 'WDMNZR' and FIND_IN_SET('publish',status) limit 1

    public function addToCart(Request $request){
        $id = $request->id;
        $color_id = (int)$request->color;
        $size_id = (int)$request->size;
        $qty = is_numeric($request->qty) && $request->qty > 0 ? $request->qty : 1;
        if ($request->ajax() && is_numeric($id)) {
            $product = DB::table('products as A')
                ->leftjoin('product_languages as B', 'A.id','=','B.product_id')
                ->select('A.*','B.title')
                ->where('A.id',$id)
                ->where('B.language', $this->_data['lang'])
                ->first();
            $color = DB::table('attribute_languages')
                ->select('title')
                ->where('attribute_id',$color_id)
                ->where('language',$this->_data['lang'])
                ->first();
            $size = DB::table('attribute_languages')
                ->select('title')
                ->where('attribute_id',$size_id)
                ->where('language',$this->_data['lang'])
                ->first();
---
select `A`.*, `B`.`title` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `A`.`id` = '10' and `B`.`language` = 'vi' limit 1
select `title` from `attribute_languages` where `attribute_id` = '0' and `language` = 'vi' limit 1