app/Http/Controllers/Frontend/HomeController.php

    public function index(Request $request){
        $this->_data['new_products'] = DB::table('products as A')
            ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
            ->select('A.id','A.code','A.regular_price','A.sale_price','A.link','A.image','A.alt','A.category_id','A.user_id','A.type','A.status','B.title', 'B.slug')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status) and FIND_IN_SET(\'new\',A.status)')
            ->where('A.type','san-pham')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->limit(10)
            ->get();

        $this->_data['single_post'] = get_pages('san-pham-moi');

        $this->_data['collections'] = DB::table('posts as A')
            ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
            ->select('A.id','A.link','A.image','A.alt','A.updated_at','B.title','B.slug','B.description')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type','bo-suu-tap')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->limit(8)
            ->get();

        $this->_data['banners'] = get_photos('banner');

        $this->_data['new_posts'] = DB::table('posts as A')
            ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
            ->select('A.id','A.link','A.image','A.alt','A.updated_at','B.title','B.slug','B.description')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status) and FIND_IN_SET(\'new\',A.status)')
            ->where('A.type','tin-tuc')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->limit(6)
            ->get();
---
select `A`.`id`, `A`.`code`, `A`.`regular_price`, `A`.`sale_price`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`category_id`, `A`.`user_id`, `A`.`type`, `A`.`status`, `B`.`title`, `B`.`slug` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and FIND_IN_SET('new',A.status) and `A`.`type` = 'san-pham' order by `A`.`priority` asc, `A`.`id` desc limit 10
select `A`.`id`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`updated_at`, `B`.`title`, `B`.`slug`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'bo-suu-tap' order by `A`.`priority` asc, `A`.`id` desc limit 8
select `A`.`id`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`updated_at`, `B`.`title`, `B`.`slug`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and FIND_IN_SET('new',A.status) and `A`.`type` = 'tin-tuc' order by `A`.`priority` asc, `A`.`id` desc limit 6

    public function category($type,$slug){

        $this->_data['category'] = DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.*', 'B.title', 'B.slug', 'B.meta_seo')
            ->where('B.language', $this->_data['lang'])
            ->where('B.slug',$slug)
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type',$type)
            ->first();

        if( $this->_data['category'] && $this->_data['category']->meta_seo !='' ){
            $current_seo = json_decode($this->_data['category']->meta_seo);
            $current_seo->title ? $this->_data['meta_seo']->title = $current_seo->title : '';
            $current_seo->keywords ? $this->_data['meta_seo']->keywords = $current_seo->keywords : '';
            $current_seo->description ? $this->_data['meta_seo']->description = $current_seo->description : '';
        }

        if( $this->_data['category'] ){
            $category_id = $this->_data['category']->id;

            $this->_data['breadcrumb'] .= '<li class="active"> '.$this->_data['category']->title.' </li>';
            if($this->_data['template'] == 'product'){
                $this->_data['products'] = DB::table('products as A')
                    ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
                    ->select('A.id','A.code','A.regular_price','A.sale_price','A.link','A.image','A.alt','A.category_id','A.user_id','A.type','A.status','B.title', 'B.slug')
                    ->where('B.language',$this->_data['lang'])
                    ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
                    ->where('A.category_id',$category_id)
                    ->where('A.type',$type)
                    ->orderBy('A.priority','asc')
                    ->orderBy('A.id','desc')
                    ->paginate(config('settings.product_per_page') ? config('settings.product_per_page') : 20);
---
select `A`.*, `B`.`title`, `B`.`slug`, `B`.`meta_seo` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `B`.`language` = 'vi' and `B`.`slug` = 'ao-thun-nu' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'san-pham' limit 1
select count(*) as aggregate from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`category_id` = '8' and `A`.`type` = 'san-pham'

            $this->_data['products']->withPath( route('frontend.home.archive', $params ) );
            return view('frontend.default.products',$this->_data);
        }elseif($this->_data['template'] == 'post'){
            $this->_data['posts'] = DB::table('posts as A')
                ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
                ->select('A.id','A.link','A.image','A.alt','A.updated_at','B.title','B.slug','B.description')
                ->where('B.language',$this->_data['lang'])
                ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
                ->where('A.type',$type)
                ->orderBy('A.priority','asc')
                ->orderBy('A.id','desc')
                ->paginate(config('settings.post_per_page') ? config('settings.post_per_page') : 10);
---
select count(*) as aggregate from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'dich-vu'

    public function page(Request $request, $type,$slug){
        if($this->_data['template'] == 'product'){
            $this->_data['product'] = DB::table('products as A')
                ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
                ->select('A.*','B.title','B.description','B.contents','B.attributes','B.meta_seo')
                ->where('B.language',$this->_data['lang'])
                ->where('B.slug',$slug)
                ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
                ->where('A.type',$type)
                ->first();

            if( $this->_data['product'] && $this->_data['product']->meta_seo !='' ){
                $current_seo = json_decode($this->_data['product']->meta_seo);
                $current_seo->title ? $this->_data['meta_seo']->title = $current_seo->title : '';
                $current_seo->keywords ? $this->_data['meta_seo']->keywords = $current_seo->keywords : '';
                $current_seo->description ? $this->_data['meta_seo']->description = $current_seo->description : '';
                $this->_data['product']->image ? $this->_data['meta_seo']->image = asset('public/uploads/products/'.get_thumbnail($this->_data['product']->image, '_medium')) : '';
            }

            if( $this->_data['product'] ){
                $client_ip = $request->getClientIp();
                if(!Cache::has($client_ip.'_product_view_'.$this->_data['product']->id)){
                    $this->_data['product']->viewed += 1;
                    DB::table('products')->where('id',$this->_data['product']->id)->increment('viewed',1);
---
select `A`.*, `B`.`title`, `B`.`description`, `B`.`contents`, `B`.`attributes`, `B`.`meta_seo` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and `B`.`slug` = 'ten-san-pham-1' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'san-pham' limit 1
update `products` set `viewed` = `viewed` + 1 where `id` = '10'

                $this->_data['sizes'] = get_attributes('product_sizes');
                $this->_data['tags'] = get_attributes('product_tags');

                $comments = DB::table('comments')
                    ->where('product_id',$this->_data['product']->id)
                    ->whereRaw('FIND_IN_SET(\'publish\',status)')
                    ->orderBy('parent','asc')
                    ->orderBy('id','desc')
                    ->get();
---
select * from `comments` where `product_id` = '10' and FIND_IN_SET('publish',status) order by `parent` asc, `id` desc

                }
                $this->_data['countComment'] = count($comments);

                $this->_data['products'] = DB::table('products as A')
                    ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
                    ->select('A.id','A.code','A.regular_price','A.sale_price','A.link','A.image','A.alt','A.category_id','A.user_id','A.type','A.status','B.title', 'B.slug')
                    ->where('B.language',$this->_data['lang'])
                    ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
                    ->where('A.id','!=',$this->_data['product']->id)
                    ->where('A.category_id',$this->_data['product']->category_id)
                    ->where('A.type',$type)
                    ->orderBy('A.priority','asc')
                    ->orderBy('A.id','desc')
                    ->limit(15)
                    ->get();
---
select `A`.`id`, `A`.`code`, `A`.`regular_price`, `A`.`sale_price`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`category_id`, `A`.`user_id`, `A`.`type`, `A`.`status`, `B`.`title`, `B`.`slug` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`id` != '10' and `A`.`category_id` = '1' and `A`.`type` = 'san-pham' order by `A`.`priority` asc, `A`.`id` desc limit 15