app/Http/Controllers/Frontend/MemberController.php

select * from `members` where `members`.`id` = '1' limit 1
---
    public function profile(Request $request){

        $this->_data['site']['title'] = __('site.member');
        $this->_data['breadcrumb'] = '<li> <a href="'.url('/').'">'.__('site.home').'</a> </li>';
        $this->_data['breadcrumb'] .= '<li> <a href="'.url('/member').'"> '.__('account.profile').' </a> </li>';

        $id = auth()->guard('member')->user()->id;
        $member = Member::find($id);

select count(*) as aggregate from `orders` where `member_id` = '1'
---
    public function orders(){

        $this->_data['site']['title'] = __('site.member');
        $this->_data['breadcrumb'] = '<li> <a href="'.url('/').'">'.__('site.home').'</a> </li>';
        $this->_data['breadcrumb'] .= '<li> <a href="'.url('/member').'"> '.__('account.profile').' </a> </li>';

        $id = auth()->guard('member')->user()->id;
        $this->_data['items'] = Order::where('member_id',$id)->paginate(25);