app/Http/Controllers/Admin/AttributeController.php

insert into `attributes` (`value`, `regular_price`, `sale_price`, `priority`, `status`, `type`, `created_at`, `updated_at`) values ('#0022ff', '0', '0', '1', 'publish', 'product_colors', '2018-07-18 20:42:24', '2018-07-18 20:42:24')
---
    public function store(Request $request){

        $valid = Validator::make($request->all(), [
            'dataL.vi.title' => 'required',
        ], [
            'dataL.vi.title.required'    => 'Vui lòng nhập Tên Thuộc Tính',
        ]);

        if ($valid->fails()) {
            if($request->ajax()){
                return response()->json(['type'=>'danger', 'icon'=>'warning', 'message'=>$valid->errors()->first()]);
            }
            return redirect()->back()->withErrors($valid)->withInput();
        } else {
            $attribute  = new Attribute;
            if($request->data){
                foreach($request->data as $field => $value){
                    $attribute->$field = $value;
                }
            }
            $attribute->regular_price  = floatval(str_replace('.', '', $request->regular_price));
            $attribute->sale_price     = floatval(str_replace('.', '', $request->sale_price));
            $attribute->priority   = (int)str_replace('.', '', $request->priority);
            $attribute->status     = ($request->status) ? implode(',',$request->status) : '';
            $attribute->type       = $this->_data['type'];
            $attribute->created_at = new DateTime();
            $attribute->updated_at = new DateTime();
            $attribute->save();

insert into `attribute_languages` (`title`, `slug`, `language`, `attribute_id`) values ('Xanh', 'xanh', 'vi', '2')
select `id` from `attributes` where `type` = 'product_colors' order by `priority` asc, `id` desc
---
                $dataL['language']   = $lang;
                $dataInsert[]        = new AttributeLanguage($dataL);
            }
            $attribute->languages()->saveMany($dataInsert);
            if($request->ajax()){
                $items = Attribute::select('id')->where('type',$this->_data['type'])->orderBy('priority','asc')->orderBy('id','desc')->with(['languages' => function($query){
                    $query->select('attribute_id','title')->where('language', $this->_data['default_language'] );
                }])->get();