app/Http/Controllers/Admin/CategoryController.php

select `A`.*, `B`.`title` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `A`.`priority` > '0' and `A`.`type` = 'tin-tuc' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `A`.`priority` > '0' and `A`.`type` = 'tin-tuc' and `B`.`language` = 'vi'
---
    public function index()
    {
        $this->_data['items'] = DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.*','B.title')
            ->where('A.priority','>',0)
            ->where('A.type',$this->_data['type'])
            ->where('B.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);

insert into `categories` (`parent`, `priority`, `status`, `type`, `created_at`, `updated_at`) values ('0', '4', 'publish', 'san-pham', '2018-06-30 00:28:19', '2018-06-30 00:28:19')
---
            $category->type       = $this->_data['type'];
            $category->created_at = new DateTime();
            $category->updated_at = new DateTime();
            $category->save();

insert into `category_languages` (`title`, `meta_seo`, `slug`, `language`, `category_id`) values ('Phụ kiện', '{\"title\":null,\"keywords\":null,\"description\":null}', 'phu-kien', 'vi', '5')
---
                $dataL['language']   = $lang;
                $dataInsert[]        = new CategoryLanguage($dataL);
            }
            $category->languages()->saveMany($dataInsert);

select `A`.`id`, `A`.`parent`, `B`.`title` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `A`.`type` = 'thue-xe' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc
---
    public function getCategory($type){
        return DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.id', 'A.parent', 'B.title')
            ->where('A.type',$type)
            ->where('B.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();