app/Http/Controllers/Admin/CommentController.php

select `title`, `product_id` from `product_languages` where `product_id` in ('10', '10', '10', '10', '10', '10', '10') and `language` = 'vi'
select count(*) as aggregate from `comments` where `product_id` = '10'
---
    public function index(){
        $this->_data['items'] = DB::table('product_languages')
            ->select('title', 'product_id')
            ->whereIn('product_id', DB::table('comments')->pluck('product_id') )
            ->where('language', $this->_data['default_language'])
            ->get();
        foreach( $this->_data['items'] as $key => $item ){
            $this->_data['items'][$key]->sum = DB::table('comments')->where('product_id',$item->product_id)->count();

select * from `comments` as `A` where `product_id` = '10' and `type` = 'default' order by `priority` asc, `id` desc
---
    public function ajax(Request $request){
        if($request->table == 'products'){
            $items = DB::table('comments as A')
                ->where('product_id',$request->id)
                ->where('type',$this->_data['type'])
                ->orderBy('priority','asc')
                ->orderBy('id','desc')
                ->get();