app/Http/Controllers/Admin/MemberController.php

select * from `members` order by `priority` asc, `id` desc limit 25 offset 0
select count(*) as aggregate from `members`
---
    public function index()
    {
        $this->_data['items'] = Member::orderBy('priority','asc')->orderBy('id','desc')->paginate(25);

select * from `members` where `members`.`id` = '3' limit 1
---
    public function edit($id){
        $this->_data['item'] = Member::find($id);