app/Http/Controllers/Admin/OrderController.php

    public function index(){

        $this->_data['items'] = DB::table('orders as A')
            ->where('A.type',$this->_data['type'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);

        $this->_data['total'] = DB::table('orders')
            ->select(DB::raw('sum(order_qty) as qty, sum(order_price) as price'))
            ->where('status_id', '<' , 4)
            ->where('type',$this->_data['type'])->first();
---
select count(*) as aggregate from `orders` as `A` where `A`.`type` = 'thue-xe'
select sum(order_qty) as qty, sum(order_price) as price from `orders` where `status_id` < '4' and `type` = 'thue-xe' limit 1

    public function edit($id){
        $this->_data['item'] = Order::find($id);
        if ($this->_data['item'] !== null) {
            $this->_data['products'] = $this->_data['item']->details()->get();
            $products = [];
            if($this->_data['products'] !== null){
                foreach($this->_data['products'] as $key => $val){
                    $colors = DB::table('attributes as A')
                                ->leftjoin('attribute_languages as B', 'A.id','=','B.attribute_id')
                                ->select('A.id','B.title')
                                ->whereIn('A.id', DB::table('product_attribute')->where('product_id',$val->product_id)->where('type','product_colors')->pluck('attribute_id') )
                                ->where('A.type','product_colors')
                                ->where('B.language', $this->_data['default_language'])
                                ->orderBy('A.priority','asc')
                                ->orderBy('A.id','desc')
                                ->get();
                    $sizes = DB::table('attributes as A')
                                ->leftjoin('attribute_languages as B', 'A.id','=','B.attribute_id')
                                ->select('A.id','B.title')
                                ->whereIn('A.id', DB::table('product_attribute')->where('product_id',$val->product_id)->where('type','product_sizes')->pluck('attribute_id') )
                                ->where('A.type','product_sizes')
                                ->where('B.language', $this->_data['default_language'])
                                ->orderBy('A.priority','asc')
                                ->orderBy('A.id','desc')
                                ->get();
---
select * from `orders` where `orders`.`id` = '1' limit 1
select `A`.`id`, `B`.`title` from `attributes` as `A` left join `attribute_languages` as `B` on `A`.`id` = `B`.`attribute_id` where 0 = 1 and `A`.`type` = 'product_colors' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc
select `A`.`id`, `B`.`title` from `attributes` as `A` left join `attribute_languages` as `B` on `A`.`id` = `B`.`attribute_id` where 0 = 1 and `A`.`type` = 'product_sizes' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc