app/Http/Controllers/Admin/PostController.php

select * from `posts` where `posts`.`id` = '17' limit 1
---
    public function update(Request $request, $id){
        // dd($request);
        $valid = Validator::make($request->all(), [
            'dataL.vi.title' => 'required',
            'image' => 'image|max:2048',
            'data.category_id' => 'exists:categories,id'
        ], [
            'dataL.vi.title.required'    => 'Vui lòng nhập Tên Bài Viết',
            'image.image' => 'Không đúng chuẩn hình ảnh cho phép',
            'image.max' => 'Dung lượng vượt quá giới hạn cho phép là :max KB',
            'data.category_id.exists' => 'Vui lòng chọn Danh mục',
        ]);
        if ($valid->fails()) {
            return redirect()->back()->withErrors($valid)->withInput();
        } else {
            $post = Post::find($id);

select * from `post_languages` where `post_languages`.`post_id` = '17' and `post_languages`.`post_id` is not null order by `id` asc
---
                $post->save();
                $i = 0;
                foreach($this->_data['languages'] as $lang => $val){
                    $postLang = PostLanguage::find($post->languages[$i]['id']);