app/Http/Controllers/Admin/SettingController.php

select * from `settings`
---
    public function index(){

    	$items = Setting::all();